# GetSegmentIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetSegmentIds Method
CompoundStructure Class See Also
---
Gets the segment ids of this compound structure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<int> GetSegmentIds()
```

Visual Basic
---
```text
Public Function GetSegmentIds As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetSegmentIds()
```

# ### Return Value
The ids of the segments which form the boundary of the regions of this CompoundStructure.
# Remarks
The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments with unique ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This operation is valid only for vertically compound structures. |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace